# 4.5 	访问DataFrame行

In [2]:
import pandas as pd
import numpy as np

## 4.5.1 	通过切片访问DataFrame行

In [2]:
L =[[3,0,1], 
    [2,1,2], 
    [0,2,1], 
    [1,3,0]]
df = pd.DataFrame(L)
df

   0  1  2
0  3  0  1
1  2  1  2
2  0  2  1
3  1  3  0

In [3]:
df[0:3]

   0  1  2
0  3  0  1
1  2  1  2
2  0  2  1

In [4]:
df[:3]

   0  1  2
0  3  0  1
1  2  1  2
2  0  2  1

In [6]:
data = {
    'apples': [3, 2, 0, 1], 
    'oranges': [0, 1, 2, 3],
    'bananas': [1, 2, 1, 0]
}
df = pd.DataFrame(data, index=['June','Robert','Lily','David'])
df

        apples  oranges  bananas
June         3        0        1
Robert       2        1        2
Lily         0        2        1
David        1        3        0

##  4.5.2 	通过布尔数组DataFrame行

In [7]:
df[[True, False, True, False]]

      apples  oranges  bananas
June       3        0        1
Lily       0        2        1

In [8]:
b = [True, False, True, False]
df[b]

      apples  oranges  bananas
June       3        0        1
Lily       0        2        1

## 4.5.3 	通过query方法访问DataFrame行

In [9]:
df.query("apples > 1")

        apples  oranges  bananas
June         3        0        1
Robert       2        1        2

In [10]:
df.query("apples > 1 and bananas <= 2")

        apples  oranges  bananas
June         3        0        1
Robert       2        1        2

In [12]:
df.query("apples > 1 or bananas < 1")

        apples  oranges  bananas
June         3        0        1
Robert       2        1        2
David        1        3        0

## 4.5.4 	通过head和tail方法访问DataFrame行

In [6]:
df = pd.read_csv("planets.csv")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [7]:
df.head(2)

            method  number  orbital_period  mass  distance  year
0  Radial Velocity       1         269.300  7.10     77.40  2006
1  Radial Velocity       1         874.774  2.21     56.95  2008

In [8]:
df.tail()

       method  number  orbital_period  mass  distance  year
1030  Transit       1        3.941507   NaN     172.0  2006
1031  Transit       1        2.615864   NaN     148.0  2007
1032  Transit       1        3.191524   NaN     174.0  2007
1033  Transit       1        4.125083   NaN     293.0  2008
1034  Transit       1        4.187757   NaN     260.0  2008

In [9]:
df.tail(2)

       method  number  orbital_period  mass  distance  year
1033  Transit       1        4.125083   NaN     293.0  2008
1034  Transit       1        4.187757   NaN     260.0  2008